Courses/4420/Lectures/Hardening/SELinux/selinux-diy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SELinux DIY Policy Module</title>
<!-- 2018-11-30 Fri 13:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a> | <a href=./>NoSlides</a>
</div>
<div id="content">
<h1 class="title">SELinux DIY Policy Module</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Example Driven</a></li>
<li><a href="#sec-2">2. seinfo demo</a></li>
<li><a href="#sec-3">3. Policy Rules</a>
<ul>
<li><a href="#sec-3-1">3.1. Policy rules TBD</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Attributes: Group Types</a></li>
<li><a href="#sec-5">5. Policy Module?</a>
<ul>
<li><a href="#sec-5-1">5.1. Policy Package</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Our hddtemp Policy</a>
<ul>
<li><a href="#sec-6-1">6.1. Check Environment</a></li>
<li><a href="#sec-6-2">6.2. Generating Initial Policy</a></li>
<li><a href="#sec-6-3">6.3. Install Policy</a></li>
<li><a href="#sec-6-4">6.4. Initial Policy: Checks</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Permissive Domains</a></li>
<li><a href="#sec-8">8. Building policy</a>
<ul>
<li><a href="#sec-8-1">8.1. Confined vs unconfined daemon</a></li>
</ul>
</li>
<li><a href="#sec-9">9. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Example Driven</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><code>man hddtemp</code> root@Milner:~# hddtemp -uF /dev/sdb /dev/sdb: WDC WD1002FAEX-00Z3A0: 91°F
</li>

<li>An SELinux policy controls the AVC decisiom making based on process
labels coupled with other   labels on the system.
</li>
<li>This is known as type enforcement.  Happens within the kernel LSM.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> seinfo demo</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><code>seinfo</code> on my PC
</li>
<li><div class="org-src-container">

<pre class="src src-bash">root@Milner:~# seinfo
Statistics for policy file: /sys/fs/selinux/policy
Policy Version:             31 (MLS enabled)
Target Policy:              selinux
Handle unknown classes:     allow
  Classes:             128    Permissions:         454
  Sensitivities:         1    Categories:         1024
  Types:              4053    Attributes:          207
  Users:                 6    Roles:                14
  Booleans:            239    Cond. Expr.:         269
  Allow:            105172    Neverallow:            0
  Auditallow:           23    Dontaudit:         17663
  Type_trans:         9231    Type_change:          72
  Type_member:          16    Range_trans:          35
  Role allow:           28    Role_trans:          416
  Constraints:         136    Validatetrans:         0
  MLS Constrain:        57    MLS Val. Tran:         0
  Permissives:           0    Polcap:                5
  Defaults:              0    Typebounds:            0
  Allowxperm:            0    Neverallowxperm:       0
  Auditallowxperm:       0    Dontauditxperm:        0
  Initial SIDs:         27    Fs_use:               26
  Genfscon:             90    Portcon:             473
  Netifcon:              0    Nodecon:               0
</pre>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Policy Rules</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Policy Rules Statement: command sourcetype targettype: class perms;
</li>
<li>command: <code>allow, dontaudit, audit2allow, neverallow</code>
</li>
<li>class: <code>file, dir, sock_file, tcp_socket, process</code>
</li>
<li>perms: <code>read, open, write</code>
</li>
<li>ex: <code>allow staff_t etc_t:file { open read getattr ioctl lock};</code>
</li>
<li>ex: <code>dontaudit staff_t shadow_t:file { open read getattr ioctl lock};</code>
</li>
</ol>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Policy rules TBD</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>m4 macro language
<ol class="org-ol">
<li>policy macros are used
define(`r<sub>file</sub><sub>perms'</sub>, `{ open read getattr lock ioctl }
</li>
</ol>
</li>
<li><code>/usr/share/selinux/devel/include/support/obj_perm_sets.spt</code>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Attributes: Group Types</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><code>attribute file_type</code>
</li>
<li><code>type etc_t, file_type</code>
</li>
<li><code>typeattribute etc_t, file_type</code>
</li>
<li><code>allow rpm_t file_type: file manage_file_perms</code>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Policy Module?</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>It is a place where all policy statements are located
</li>
<li>allows users to easily customize policy
</li>
<li>allows third parties to ship policy with their debs, rpms, &#x2026; packages
</li>

<li>similar to kernel modules
</li>
<li>recompile and reload
</li>
</ol>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Policy Package</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>Generate policy package (.pp) to be installed on systems.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Our hddtemp Policy</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Disable the current policy: <code># semodule -d hddtemp</code>
</li>
<li>Fix labels
<div class="org-src-container">

<pre class="src src-bash"># for i in $(dpkg -L hddtemp); do restorecon -R -v $i; done
# systemctl restart hddtemp
# ps -eZ |grep hddtemp
</pre>
</div>
</li>

<li>What are you getting?
</li>
</ol>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Check Environment</h3>
<div class="outline-text-3" id="text-6-1">
<ol class="org-ol">
<li>you should see <code>initrc_t</code> type
</li>
<li>default type for process without SELinux policy started by init system
</li>
<li>unconfined domain
</li>
<li>we don't want to have initrc<sub>t</sub> on a system =&gt; we need to create a policy
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Generating Initial Policy</h3>
<div class="outline-text-3" id="text-6-2">
<ol class="org-ol">
<li>Generate the policy files: [cwd was <code>/root</code> ]
<div class="org-src-container">

<pre class="src src-bash"># sepolicy generate -n myhddtemp --init $(which hddtemp)=
Created the following files:
/root/myhddtemp.te # Type Enforcement file
/root/myhddtemp.if # Interface file
/root/myhddtemp.fc # File Contexts file
/root/myhddtemp.sh # Setup Script
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Install Policy</h3>
<div class="outline-text-3" id="text-6-3">
<ol class="org-ol">
<li><code># sh myhddtemp.sh</code>
</li>
<li>Using Makefile generate .pp file
<div class="org-src-container">

<pre class="src src-bash"># make -f /usr/share/selinux/devel/Makefile myhddtemp.pp
# systemctl hddtemp stop
# semodule -i myhddtemp.pp
# for i in $(dpkg -L hddtemp);do restorecon -R -v $i;done
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Initial Policy: Checks</h3>
<div class="outline-text-3" id="text-6-4">
<ol class="org-ol">
<li><div class="org-src-container">

<pre class="src src-bash"># semodule -l | grep hddtemp
# ls -Z `which hddtemp`
# systemctl start hddtemp
# ps -eZ | grep hddtemp
# ausearch -m avc -ts recent
</pre>
</div>
</li>

<li>Does the service work correctly?
</li>
<li>Does it work without permissive?
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Permissive Domains</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>initial policies are running as permissive  domains
</li>
<li>check AVC messages: <code># ausearch -m avc -ts recent | grep hddtemp</code>
</li>
<li>make domain permissive: <code># semanage permissive -a hddtemp_t</code>
</li>
<li>users don't have to switch to permissive mode globally
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Building policy</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>loop until good policy
<ol class="org-ol">
<li>test application
</li>
<li>examine generated AVC messages
</li>
</ol>
</li>

<li>ausearch, audit2allow tools
<ol class="org-ol">
<li><code># ausearch -m avc -ts today | grep myhddtemp | audit2allow -R</code>
</li>
</ol>
</li>
<li>compile and load rules
<ol class="org-ol">
<li><code># ausearch -m avc -ts today | grep hddtemp | audit2allow -R &gt;&gt; myhddtemp.te</code>
</li>
<li><code># make -f /usr/share/selinux/devel/Makefile myhddtemp.pp</code>
</li>
<li><code># semodule -i myhddtemp.pp</code>
</li>
</ol>
</li>
<li>Test it with enforcing mode
</li>
</ol>
</div>

<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Confined vs unconfined daemon</h3>
<div class="outline-text-3" id="text-8-1">
<ol class="org-ol">
<li>without myhddtemp policy
<ol class="org-ol">
<li>ls -Z /sbin/hddtemp -&gt; bin<sub>t</sub> type
</li>
<li>init<sub>t</sub> @bin<sub>t</sub> -&gt; initrc<sub>t</sub>
</li>
</ol>
</li>
<li>with the myhddtemp policy
<ol class="org-ol">
<li>ls -Z /sbin/hddtemp -&gt; myhddtemp<sub>exec</sub><sub>t</sub> type
</li>
<li>init<sub>t</sub> @hddtemp<sub>exec</sub><sub>t</sub> -&gt; hddtemp<sub>t</sub>
</li>
</ol>
</li>
<li>run directly
<ol class="org-ol">
<li>unconfined<sub>t</sub> @hddtemp<sub>exec</sub><sub>t</sub>-&gt; hddtemp<sub>t</sub>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> End</h2>
<div class="outline-text-2" id="text-9">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-11-30
</div>
</body>
</html>
